renesas/rx-driver-package/source/r_sci_iic_rx/r_sci_iic_rx_vx.xx/r_sci_iic_rx/src/targets/rx23e-b/r_sci_iic_rx23e_b.c
    #if SCI_IIC_CFG_CH6_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch6_rom =
{
    BSP_LOCK_SCI6,
    (sci_regs_t)&SCI6, /* Cast to sci_regs_t */
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&SYSTEM.MSTPCRB.LONG, BIT25_MASK, /* Cast to R_BSP_EVENACCESS_SFR */
    &ICU.IPR[IPR_SCI6_TXI6].BYTE,
    &ICU.IR[IR_SCI6_TXI6].BYTE,
    &ICU.IR[IR_SCI6_TEI6].BYTE, BIT0_MASK,
    &ICU.IER[IER_SCI6_TXI6].BYTE, BIT4_MASK,
    &ICU.IER[IER_SCI6_TEI6].BYTE, BIT5_MASK,
    SCI_IIC_CFG_CH6_INT_PRIORITY,
    SCI_IIC_CFG_CH6_SSCL_GP,
    SCI_IIC_CFG_CH6_SSCL_PIN,
    SCI_IIC_MPC_SSCL6_ENABLE,
    SCI_IIC_CFG_CH6_SSDA_GP,
    SCI_IIC_CFG_CH6_SSDA_PIN,
    SCI_IIC_MPC_SSDA6_ENABLE,
    SCI_IIC_CFG_CH6_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH6_BITRATE_BPS,
    SCI_IIC_CFG_CH6_DIGITAL_FILTER,
    SCI_IIC_CFG_CH6_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch6_ctrl =
{
    &g_sci_iic_ch6_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)INT_ZERO, /* Cast to uint8_t */
    (sci_iic_info_t *)NULL
};
    #endif /* endif SCI_IIC_CFG_CH6_INCLUDED */

    #if SCI_IIC_CFG_CH8_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch8_rom =
{
    BSP_LOCK_SCI8,
    (sci_regs_t)&SCI8, /* Cast to sci_regs_t */
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&SYSTEM.MSTPCRC.LONG, BIT27_MASK, /* Cast to R_BSP_EVENACCESS_SFR */
    &ICU.IPR[IPR_SCI8_TXI8].BYTE,
    &ICU.IR[IR_SCI8_TXI8].BYTE,
    &ICU.IR[IR_SCI8_TEI8].BYTE, BIT0_MASK,
    &ICU.IER[IER_SCI8_TXI8].BYTE, BIT0_MASK,
    &ICU.IER[IER_SCI8_TEI8].BYTE, BIT1_MASK,
    SCI_IIC_CFG_CH8_INT_PRIORITY,
    SCI_IIC_CFG_CH8_SSCL_GP,
    SCI_IIC_CFG_CH8_SSCL_PIN,
    SCI_IIC_MPC_SSCL8_ENABLE,
    SCI_IIC_CFG_CH8_SSDA_GP,
    SCI_IIC_CFG_CH8_SSDA_PIN,
    SCI_IIC_MPC_SSDA8_ENABLE,
    SCI_IIC_CFG_CH8_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH8_BITRATE_BPS,
    SCI_IIC_CFG_CH8_DIGITAL_FILTER,
    SCI_IIC_CFG_CH8_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch8_ctrl =
{
    &g_sci_iic_ch8_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)INT_ZERO, /* Cast to uint8_t */
    (sci_iic_info_t *)NULL
};
    #endif /* endif SCI_IIC_CFG_CH8_INCLUDED */

    #if SCI_IIC_CFG_CH9_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch9_rom =
{
    BSP_LOCK_SCI9,
    (sci_regs_t)&SCI9, /* Cast to sci_regs_t */
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&SYSTEM.MSTPCRC.LONG, BIT26_MASK, /* Cast to R_BSP_EVENACCESS_SFR */
    &ICU.IPR[IPR_SCI9_TXI9].BYTE,
    &ICU.IR[IR_SCI9_TXI9].BYTE,
    &ICU.IR[IR_SCI9_TEI9].BYTE, BIT0_MASK,
    &ICU.IER[IER_SCI9_TXI9].BYTE, BIT4_MASK,
    &ICU.IER[IER_SCI9_TEI9].BYTE, BIT5_MASK,
    SCI_IIC_CFG_CH9_INT_PRIORITY,
    SCI_IIC_CFG_CH9_SSCL_GP,
    SCI_IIC_CFG_CH9_SSCL_PIN,
    SCI_IIC_MPC_SSCL9_ENABLE,
    SCI_IIC_CFG_CH9_SSDA_GP,
    SCI_IIC_CFG_CH9_SSDA_PIN,
    SCI_IIC_MPC_SSDA9_ENABLE,
    SCI_IIC_CFG_CH9_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH9_BITRATE_BPS,
    SCI_IIC_CFG_CH9_DIGITAL_FILTER,
    SCI_IIC_CFG_CH9_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch9_ctrl =
{
    &g_sci_iic_ch9_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)INT_ZERO, /* Cast to uint8_t */
    (sci_iic_info_t *)NULL
};
    #endif /* endif SCI_IIC_CFG_CH9_INCLUDED */

    #if SCI_IIC_CFG_CH12_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch12_rom =
{
    BSP_LOCK_SCI12,
    (sci_regs_t)&SCI12, /* Cast to sci_regs_t */
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&SYSTEM.MSTPCRB.LONG, BIT4_MASK, /* Cast to R_BSP_EVENACCESS_SFR */
    &ICU.IPR[IPR_SCI12_TXI12].BYTE,
    &ICU.IR[IR_SCI12_TXI12].BYTE,
    &ICU.IR[IR_SCI12_TEI12].BYTE, BIT0_MASK,
    &ICU.IER[IER_SCI12_TXI12].BYTE, BIT0_MASK,
    &ICU.IER[IER_SCI12_TEI12].BYTE, BIT1_MASK,
    SCI_IIC_CFG_CH12_INT_PRIORITY,
    SCI_IIC_CFG_CH12_SSCL_GP,
    SCI_IIC_CFG_CH12_SSCL_PIN,
    SCI_IIC_MPC_SSCL12_ENABLE,
    SCI_IIC_CFG_CH12_SSDA_GP,
    SCI_IIC_CFG_CH12_SSDA_PIN,
    SCI_IIC_MPC_SSDA12_ENABLE,
    SCI_IIC_CFG_CH12_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH12_BITRATE_BPS,
    SCI_IIC_CFG_CH12_DIGITAL_FILTER,
    SCI_IIC_CFG_CH12_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch12_ctrl =
{
    &g_sci_iic_ch12_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)INT_ZERO, /* Cast to uint8_t */
    (sci_iic_info_t *)NULL
};
    #endif /* endif SCI_IIC_CFG_CH12_INCLUDED */

/*----------------------------------------------------------------------------*/
/*   Array for start addresses of information for each SCI IIC channel        */
/*----------------------------------------------------------------------------*/
const sci_iic_hdl_t g_sci_iic_handles[SCI_IIC_NUM_CH_MAX] =
{
    #if SCI_IIC_CFG_CH0_INCLUDED
    &g_sci_iic_ch0_ctrl,
    #else
    NULL,
    #endif
    #if SCI_IIC_CFG_CH1_INCLUDED
    &g_sci_iic_ch1_ctrl,
    #else
    NULL,
    #endif
    NULL,
    NULL,
    NULL,
    #if SCI_IIC_CFG_CH5_INCLUDED
    &g_sci_iic_ch5_ctrl,
    #else
    NULL,
    #endif
    #if SCI_IIC_CFG_CH6_INCLUDED
    &g_sci_iic_ch6_ctrl,
    #else
    NULL,
    #endif
    NULL,
    #if SCI_IIC_CFG_CH8_INCLUDED
    &g_sci_iic_ch8_ctrl,
    #else
    NULL,
    #endif
    #if SCI_IIC_CFG_CH9_INCLUDED
    &g_sci_iic_ch9_ctrl,
    #else
    NULL,
    #endif
    NULL,
    NULL,
    #if SCI_IIC_CFG_CH12_INCLUDED
    &g_sci_iic_ch12_ctrl
    #else
    NULL
    #endif
};

/***********************************************************************************************************************
 Private global variables and functions
 **********************************************************************************************************************/
static void sci_iic_set_frequency (sci_iic_info_t * p_sci_iic_info);
static void sci_iic_clear_ir_flag (sci_iic_info_t * p_sci_iic_info);

